{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"lstm_49_input": {"name": "lstm_49_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "1662"}]}}}, "outputs": {"dense_49": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1662"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/dense_49/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "6"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_49/dense_49/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "lstm_49_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "1662"}]}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80OS9sc3RtXzQ5L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_30", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80OS9sc3RtXzQ5L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/Read_2/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80OS9sc3RtXzQ5L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80OS9sc3RtXzQ5L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80OS9sc3RtXzQ5L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/Shape", "op": "Shape", "input": ["lstm_49_input"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/transpose", "op": "Transpose", "input": ["lstm_49_input", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2_1"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80OS9sc3RtXzQ5L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_76"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_41", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_30", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_77"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_78"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_23", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_70"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_21", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_68"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/Shape", "StatefulPartitionedCall/sequential_49/lstm_49/strided_slice/stack", "StatefulPartitionedCall/sequential_49/lstm_49/strided_slice/stack_1", "StatefulPartitionedCall/sequential_49/lstm_49/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_24", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_71"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/strided_slice", "StatefulPartitionedCall/sequential_49/lstm_49/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/strided_slice", "StatefulPartitionedCall/sequential_49/lstm_49/zeros/packed/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_28", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80OS9sc3RtXzQ5L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/zeros_1/packed", "StatefulPartitionedCall/sequential_49/lstm_49/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/zeros/packed", "StatefulPartitionedCall/sequential_49/lstm_49/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_39", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_28", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_75"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80OS9sc3RtXzQ5L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_26", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/zeros_1"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80OS9sc3RtXzQ5L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_25", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/zeros"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80OS9sc3RtXzQ5L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_27", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_74"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_37", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_26", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_73"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/enter/_25", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_72"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/cond/_19/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_34", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_38", "^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_32"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/LoopCond/_43", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/cond/_19/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_10_switch/_49", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_37", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_51", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_39", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_11_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_9_switch/_48", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_36", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_12_switch/_53", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_41", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_13_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/time_switch/_46", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_34", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_counter_switch/_44", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_32", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2_1_switch/_47", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_35", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_switch/_50", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/merge/_38", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_counter_switch/_44:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/exit/_59", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2_1_switch/_47"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/TensorArrayV2Write/TensorListSetItem/index", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_75", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_51:1", "^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_11_switch/_52:1", "^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_77", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_12_switch/_53:1", "^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_9_switch/_48:1", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_12_switch/_53:1", "^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_78", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_13_switch/_54:1", "^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_74", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_switch/_50:1", "^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/exit/_59", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_51:1", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/time_switch/_46:1", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/time_switch/_46:1", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_counter_switch/_44:1", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_2/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_11_switch/_52:1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_70", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_2", "^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_68", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_3", "^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_49/dense_49/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/sequential_49/dense_49/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_49/dense_49/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/MatMul", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/dense_49/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_49/dense_49/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_13_switch/_54:1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_49/dense_49/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/split/split_dim", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/Sigmoid_1", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/input/_10_switch/_49:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/Sigmoid", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/mul", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_73", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_1", "^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/Sigmoid_2", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_72", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/mul_2", "^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2_1_switch/_47:1", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/TensorArrayV2Write/TensorListSetItem/index", "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/next_iteration/_71", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2_1/num_elements", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/Read/ReadVariableOp", "shape": [1662, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/Read_1/ReadVariableOp", "shape": [256, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/Read_2/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/dense_49/MatMul/ReadVariableOp", "shape": [256, 6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_49/dense_49/BiasAdd/ReadVariableOp", "shape": [6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/TensorArrayV2Write/TensorListSetItem/index", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_2/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_49/lstm_49/PartitionedCall/while/body/_20/while/add_3/y", "shape": [], "dtype": "int32"}]}]}